esp8266/Arduino/boards.txt
##############################################################
huzzah.name=Adafruit Feather HUZZAH ESP8266
huzzah.build.board=ESP8266_ESP12
huzzah.build.variant=adafruit
huzzah.upload.tool=esptool
huzzah.upload.maximum_data_size=81920
huzzah.upload.wait_for_upload_port=true
huzzah.upload.erase_cmd=
huzzah.serial.disableDTR=true
huzzah.serial.disableRTS=true
huzzah.build.mcu=esp8266
huzzah.build.core=esp8266
huzzah.build.spiffs_pagesize=256
huzzah.build.debug_port=
huzzah.build.debug_level=
huzzah.menu.xtal.80=80 MHz
huzzah.menu.xtal.80.build.f_cpu=80000000L
huzzah.menu.xtal.160=160 MHz
huzzah.menu.xtal.160.build.f_cpu=160000000L
huzzah.menu.vt.flash=Flash
huzzah.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
huzzah.menu.vt.heap=Heap
huzzah.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
huzzah.menu.vt.iram=IRAM
huzzah.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
huzzah.menu.exception.disabled=Disabled (new aborts on oom)
huzzah.menu.exception.disabled.build.exception_flags=-fno-exceptions
huzzah.menu.exception.disabled.build.stdcpp_lib=-lstdc++
huzzah.menu.exception.enabled=Enabled
huzzah.menu.exception.enabled.build.exception_flags=-fexceptions
huzzah.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
huzzah.menu.stacksmash.disabled=Disabled
huzzah.menu.stacksmash.disabled.build.stacksmash_flags=
huzzah.menu.stacksmash.enabled=Enabled
huzzah.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
huzzah.menu.ssl.all=All SSL ciphers (most compatible)
huzzah.menu.ssl.all.build.sslflags=
huzzah.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
huzzah.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
huzzah.menu.waveform.pwm=Locked PWM
huzzah.menu.waveform.pwm.build.waveform=
huzzah.menu.waveform.phase=Locked Phase
huzzah.menu.waveform.phase.build.waveform=-DWAVEFORM_LOCKED_PHASE
huzzah.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
huzzah.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
huzzah.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
huzzah.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
huzzah.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
huzzah.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
huzzah.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
huzzah.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
huzzah.menu.mmu.ext128k=128K External 23LC1024
huzzah.menu.mmu.ext128k.build.mmuflags=-DUMM_HEAP_EXTERNAL=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
huzzah.menu.mmu.ext1024k=1M External 64 MBit PSRAM
huzzah.menu.mmu.ext1024k.build.mmuflags=-DUMM_HEAP_EXTERNAL=1024 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
huzzah.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
huzzah.menu.non32xfer.fast.build.non32xferflags=
huzzah.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
huzzah.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
huzzah.upload.resetmethod=--before default_reset --after hard_reset
huzzah.build.flash_mode=qio
huzzah.build.flash_flags=-DFLASHMODE_QIO
huzzah.build.flash_freq=40
huzzah.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
huzzah.menu.eesz.4M2M.build.flash_size=4M
huzzah.menu.eesz.4M2M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
huzzah.menu.eesz.4M2M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M2M.upload.maximum_size=1044464
huzzah.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M2M.build.spiffs_start=0x200000
huzzah.menu.eesz.4M2M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M2M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
huzzah.menu.eesz.4M3M.build.flash_size=4M
huzzah.menu.eesz.4M3M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
huzzah.menu.eesz.4M3M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M3M.upload.maximum_size=1044464
huzzah.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M3M.build.spiffs_start=0x100000
huzzah.menu.eesz.4M3M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M3M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
huzzah.menu.eesz.4M1M.build.flash_size=4M
huzzah.menu.eesz.4M1M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
huzzah.menu.eesz.4M1M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M1M.upload.maximum_size=1044464
huzzah.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M1M.build.spiffs_start=0x300000
huzzah.menu.eesz.4M1M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M1M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
huzzah.menu.eesz.4M.build.flash_size=4M
huzzah.menu.eesz.4M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
huzzah.menu.eesz.4M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M.upload.maximum_size=1044464
huzzah.menu.eesz.4M.build.rfcal_addr=0x3FC000
huzzah.menu.ip.lm2f=v2 Lower Memory
huzzah.menu.ip.lm2f.build.lwip_include=lwip2/include
huzzah.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
huzzah.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
huzzah.menu.ip.hb2f=v2 Higher Bandwidth
huzzah.menu.ip.hb2f.build.lwip_include=lwip2/include
huzzah.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
huzzah.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
huzzah.menu.ip.lm2n=v2 Lower Memory (no features)
huzzah.menu.ip.lm2n.build.lwip_include=lwip2/include
huzzah.menu.ip.lm2n.build.lwip_lib=-llwip2-536
huzzah.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
huzzah.menu.ip.hb2n=v2 Higher Bandwidth (no features)
huzzah.menu.ip.hb2n.build.lwip_include=lwip2/include
huzzah.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
huzzah.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
huzzah.menu.ip.lm6f=v2 IPv6 Lower Memory
huzzah.menu.ip.lm6f.build.lwip_include=lwip2/include
huzzah.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
huzzah.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
huzzah.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
huzzah.menu.ip.hb6f.build.lwip_include=lwip2/include
huzzah.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
huzzah.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
huzzah.menu.dbg.Disabled=Disabled
huzzah.menu.dbg.Disabled.build.debug_port=
huzzah.menu.dbg.Serial=Serial
huzzah.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
huzzah.menu.dbg.Serial1=Serial1
huzzah.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
huzzah.menu.lvl.None____=None
huzzah.menu.lvl.None____.build.debug_level=
huzzah.menu.lvl.SSL=SSL
huzzah.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
huzzah.menu.lvl.TLS_MEM=TLS_MEM
huzzah.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
huzzah.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
huzzah.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
huzzah.menu.lvl.HTTP_SERVER=HTTP_SERVER
huzzah.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
huzzah.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
huzzah.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
huzzah.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
huzzah.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
huzzah.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
huzzah.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
huzzah.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
huzzah.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
huzzah.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
huzzah.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
huzzah.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
huzzah.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
huzzah.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
huzzah.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
huzzah.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
huzzah.menu.lvl.CORE=CORE
huzzah.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
huzzah.menu.lvl.WIFI=WIFI
huzzah.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
huzzah.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
huzzah.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
huzzah.menu.lvl.UPDATER=UPDATER
huzzah.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
huzzah.menu.lvl.OTA=OTA
huzzah.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
huzzah.menu.lvl.OOM=OOM
huzzah.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
huzzah.menu.lvl.MDNS=MDNS
huzzah.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
huzzah.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
huzzah.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
huzzah.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
huzzah.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
huzzah.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
huzzah.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
huzzah.menu.wipe.none=Only Sketch
huzzah.menu.wipe.none.upload.erase_cmd=
huzzah.menu.wipe.sdk=Sketch + WiFi Settings
huzzah.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
huzzah.menu.wipe.all=All Flash Contents
huzzah.menu.wipe.all.upload.erase_cmd=erase_flash
huzzah.menu.baud.115200=115200
huzzah.menu.baud.115200.upload.speed=115200
huzzah.menu.baud.57600=57600
huzzah.menu.baud.57600.upload.speed=57600
huzzah.menu.baud.230400.linux=230400
huzzah.menu.baud.230400.macosx=230400
huzzah.menu.baud.230400.upload.speed=230400
huzzah.menu.baud.256000.windows=256000
huzzah.menu.baud.256000.upload.speed=256000
huzzah.menu.baud.460800.linux=460800
huzzah.menu.baud.460800.macosx=460800
huzzah.menu.baud.460800.upload.speed=460800
huzzah.menu.baud.512000.windows=512000
huzzah.menu.baud.512000.upload.speed=512000
huzzah.menu.baud.921600=921600
huzzah.menu.baud.921600.upload.speed=921600
huzzah.menu.baud.3000000=3000000
huzzah.menu.baud.3000000.upload.speed=3000000

