esp8266/Arduino/boards.txt
##############################################################
modwifi.name=Olimex MOD-WIFI-ESP8266(-DEV)
modwifi.build.board=MOD_WIFI_ESP8266
modwifi.build.variant=modwifi
modwifi.upload.tool=esptool
modwifi.upload.maximum_data_size=81920
modwifi.upload.wait_for_upload_port=true
modwifi.upload.erase_cmd=
modwifi.serial.disableDTR=true
modwifi.serial.disableRTS=true
modwifi.build.mcu=esp8266
modwifi.build.core=esp8266
modwifi.build.spiffs_pagesize=256
modwifi.build.debug_port=
modwifi.build.debug_level=
modwifi.menu.xtal.80=80 MHz
modwifi.menu.xtal.80.build.f_cpu=80000000L
modwifi.menu.xtal.160=160 MHz
modwifi.menu.xtal.160.build.f_cpu=160000000L
modwifi.menu.vt.flash=Flash
modwifi.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
modwifi.menu.vt.heap=Heap
modwifi.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
modwifi.menu.vt.iram=IRAM
modwifi.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
modwifi.menu.exception.disabled=Disabled (new aborts on oom)
modwifi.menu.exception.disabled.build.exception_flags=-fno-exceptions
modwifi.menu.exception.disabled.build.stdcpp_lib=-lstdc++
modwifi.menu.exception.enabled=Enabled
modwifi.menu.exception.enabled.build.exception_flags=-fexceptions
modwifi.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
modwifi.menu.stacksmash.disabled=Disabled
modwifi.menu.stacksmash.disabled.build.stacksmash_flags=
modwifi.menu.stacksmash.enabled=Enabled
modwifi.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
modwifi.menu.ssl.all=All SSL ciphers (most compatible)
modwifi.menu.ssl.all.build.sslflags=
modwifi.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
modwifi.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
modwifi.menu.waveform.pwm=Locked PWM
modwifi.menu.waveform.pwm.build.waveform=
modwifi.menu.waveform.phase=Locked Phase
modwifi.menu.waveform.phase.build.waveform=-DWAVEFORM_LOCKED_PHASE
modwifi.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
modwifi.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
modwifi.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
modwifi.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
modwifi.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
modwifi.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
modwifi.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
modwifi.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
modwifi.menu.mmu.ext128k=128K External 23LC1024
modwifi.menu.mmu.ext128k.build.mmuflags=-DUMM_HEAP_EXTERNAL=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
modwifi.menu.mmu.ext1024k=1M External 64 MBit PSRAM
modwifi.menu.mmu.ext1024k.build.mmuflags=-DUMM_HEAP_EXTERNAL=1024 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
modwifi.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
modwifi.menu.non32xfer.fast.build.non32xferflags=
modwifi.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
modwifi.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
modwifi.upload.resetmethod=--before no_reset --after soft_reset
modwifi.build.flash_mode=qio
modwifi.build.flash_flags=-DFLASHMODE_QIO
modwifi.build.flash_freq=40
modwifi.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
modwifi.menu.eesz.2M64.build.flash_size=2M
modwifi.menu.eesz.2M64.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
modwifi.menu.eesz.2M64.build.spiffs_pagesize=256
modwifi.menu.eesz.2M64.upload.maximum_size=1044464
modwifi.menu.eesz.2M64.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M64.build.spiffs_start=0x1F0000
modwifi.menu.eesz.2M64.build.spiffs_end=0x1FB000
modwifi.menu.eesz.2M64.build.spiffs_blocksize=4096
modwifi.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
modwifi.menu.eesz.2M128.build.flash_size=2M
modwifi.menu.eesz.2M128.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
modwifi.menu.eesz.2M128.build.spiffs_pagesize=256
modwifi.menu.eesz.2M128.upload.maximum_size=1044464
modwifi.menu.eesz.2M128.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M128.build.spiffs_start=0x1E0000
modwifi.menu.eesz.2M128.build.spiffs_end=0x1FB000
modwifi.menu.eesz.2M128.build.spiffs_blocksize=4096
modwifi.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
modwifi.menu.eesz.2M256.build.flash_size=2M
modwifi.menu.eesz.2M256.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
modwifi.menu.eesz.2M256.build.spiffs_pagesize=256
modwifi.menu.eesz.2M256.upload.maximum_size=1044464
modwifi.menu.eesz.2M256.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M256.build.spiffs_start=0x1C0000
modwifi.menu.eesz.2M256.build.spiffs_end=0x1FB000
modwifi.menu.eesz.2M256.build.spiffs_blocksize=4096
modwifi.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
modwifi.menu.eesz.2M512.build.flash_size=2M
modwifi.menu.eesz.2M512.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
modwifi.menu.eesz.2M512.build.spiffs_pagesize=256
modwifi.menu.eesz.2M512.upload.maximum_size=1044464
modwifi.menu.eesz.2M512.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M512.build.spiffs_start=0x180000
modwifi.menu.eesz.2M512.build.spiffs_end=0x1FA000
modwifi.menu.eesz.2M512.build.spiffs_blocksize=8192
modwifi.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
modwifi.menu.eesz.2M1M.build.flash_size=2M
modwifi.menu.eesz.2M1M.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
modwifi.menu.eesz.2M1M.build.spiffs_pagesize=256
modwifi.menu.eesz.2M1M.upload.maximum_size=1044464
modwifi.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M1M.build.spiffs_start=0x100000
modwifi.menu.eesz.2M1M.build.spiffs_end=0x1FA000
modwifi.menu.eesz.2M1M.build.spiffs_blocksize=8192
modwifi.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
modwifi.menu.eesz.2M.build.flash_size=2M
modwifi.menu.eesz.2M.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
modwifi.menu.eesz.2M.build.spiffs_pagesize=256
modwifi.menu.eesz.2M.upload.maximum_size=1044464
modwifi.menu.eesz.2M.build.rfcal_addr=0x1FC000
modwifi.menu.ip.lm2f=v2 Lower Memory
modwifi.menu.ip.lm2f.build.lwip_include=lwip2/include
modwifi.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
modwifi.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
modwifi.menu.ip.hb2f=v2 Higher Bandwidth
modwifi.menu.ip.hb2f.build.lwip_include=lwip2/include
modwifi.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
modwifi.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
modwifi.menu.ip.lm2n=v2 Lower Memory (no features)
modwifi.menu.ip.lm2n.build.lwip_include=lwip2/include
modwifi.menu.ip.lm2n.build.lwip_lib=-llwip2-536
modwifi.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
modwifi.menu.ip.hb2n=v2 Higher Bandwidth (no features)
modwifi.menu.ip.hb2n.build.lwip_include=lwip2/include
modwifi.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
modwifi.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
modwifi.menu.ip.lm6f=v2 IPv6 Lower Memory
modwifi.menu.ip.lm6f.build.lwip_include=lwip2/include
modwifi.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
modwifi.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
modwifi.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
modwifi.menu.ip.hb6f.build.lwip_include=lwip2/include
modwifi.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
modwifi.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
modwifi.menu.dbg.Disabled=Disabled
modwifi.menu.dbg.Disabled.build.debug_port=
modwifi.menu.dbg.Serial=Serial
modwifi.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
modwifi.menu.dbg.Serial1=Serial1
modwifi.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
modwifi.menu.lvl.None____=None
modwifi.menu.lvl.None____.build.debug_level=
modwifi.menu.lvl.SSL=SSL
modwifi.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
modwifi.menu.lvl.TLS_MEM=TLS_MEM
modwifi.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
modwifi.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
modwifi.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.HTTP_SERVER=HTTP_SERVER
modwifi.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
modwifi.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
modwifi.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
modwifi.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
modwifi.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
modwifi.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.CORE=CORE
modwifi.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
modwifi.menu.lvl.WIFI=WIFI
modwifi.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
modwifi.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
modwifi.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
modwifi.menu.lvl.UPDATER=UPDATER
modwifi.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
modwifi.menu.lvl.OTA=OTA
modwifi.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
modwifi.menu.lvl.OOM=OOM
modwifi.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
modwifi.menu.lvl.MDNS=MDNS
modwifi.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
modwifi.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
modwifi.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
modwifi.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
modwifi.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
modwifi.menu.wipe.none=Only Sketch
modwifi.menu.wipe.none.upload.erase_cmd=
modwifi.menu.wipe.sdk=Sketch + WiFi Settings
modwifi.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
modwifi.menu.wipe.all=All Flash Contents
modwifi.menu.wipe.all.upload.erase_cmd=erase_flash
modwifi.menu.baud.115200=115200
modwifi.menu.baud.115200.upload.speed=115200
modwifi.menu.baud.57600=57600
modwifi.menu.baud.57600.upload.speed=57600
modwifi.menu.baud.230400.linux=230400
modwifi.menu.baud.230400.macosx=230400
modwifi.menu.baud.230400.upload.speed=230400
modwifi.menu.baud.256000.windows=256000
modwifi.menu.baud.256000.upload.speed=256000
modwifi.menu.baud.460800.linux=460800
modwifi.menu.baud.460800.macosx=460800
modwifi.menu.baud.460800.upload.speed=460800
modwifi.menu.baud.512000.windows=512000
modwifi.menu.baud.512000.upload.speed=512000
modwifi.menu.baud.921600=921600
modwifi.menu.baud.921600.upload.speed=921600
modwifi.menu.baud.3000000=3000000
modwifi.menu.baud.3000000.upload.speed=3000000

