esp8266/Arduino/boards.txt
##############################################################
blynk.name=SparkFun Blynk Board
blynk.build.board=ESP8266_THING
blynk.build.variant=thing
blynk.upload.tool=esptool
blynk.upload.maximum_data_size=81920
blynk.upload.wait_for_upload_port=true
blynk.upload.erase_cmd=
blynk.serial.disableDTR=true
blynk.serial.disableRTS=true
blynk.build.mcu=esp8266
blynk.build.core=esp8266
blynk.build.spiffs_pagesize=256
blynk.build.debug_port=
blynk.build.debug_level=
blynk.menu.xtal.80=80 MHz
blynk.menu.xtal.80.build.f_cpu=80000000L
blynk.menu.xtal.160=160 MHz
blynk.menu.xtal.160.build.f_cpu=160000000L
blynk.menu.vt.flash=Flash
blynk.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
blynk.menu.vt.heap=Heap
blynk.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
blynk.menu.vt.iram=IRAM
blynk.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
blynk.menu.exception.disabled=Disabled (new aborts on oom)
blynk.menu.exception.disabled.build.exception_flags=-fno-exceptions
blynk.menu.exception.disabled.build.stdcpp_lib=-lstdc++
blynk.menu.exception.enabled=Enabled
blynk.menu.exception.enabled.build.exception_flags=-fexceptions
blynk.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
blynk.menu.stacksmash.disabled=Disabled
blynk.menu.stacksmash.disabled.build.stacksmash_flags=
blynk.menu.stacksmash.enabled=Enabled
blynk.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
blynk.menu.ssl.all=All SSL ciphers (most compatible)
blynk.menu.ssl.all.build.sslflags=
blynk.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
blynk.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
blynk.menu.waveform.pwm=Locked PWM
blynk.menu.waveform.pwm.build.waveform=
blynk.menu.waveform.phase=Locked Phase
blynk.menu.waveform.phase.build.waveform=-DWAVEFORM_LOCKED_PHASE
blynk.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
blynk.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
blynk.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
blynk.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
blynk.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
blynk.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
blynk.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
blynk.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
blynk.menu.mmu.ext128k=128K External 23LC1024
blynk.menu.mmu.ext128k.build.mmuflags=-DUMM_HEAP_EXTERNAL=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
blynk.menu.mmu.ext1024k=1M External 64 MBit PSRAM
blynk.menu.mmu.ext1024k.build.mmuflags=-DUMM_HEAP_EXTERNAL=1024 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
blynk.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
blynk.menu.non32xfer.fast.build.non32xferflags=
blynk.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
blynk.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
blynk.upload.resetmethod=--before default_reset --after hard_reset
blynk.build.flash_mode=qio
blynk.build.flash_flags=-DFLASHMODE_QIO
blynk.build.flash_freq=40
blynk.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
blynk.menu.eesz.4M2M.build.flash_size=4M
blynk.menu.eesz.4M2M.build.flash_size_bytes=0x400000
blynk.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
blynk.menu.eesz.4M2M.build.spiffs_pagesize=256
blynk.menu.eesz.4M2M.upload.maximum_size=1044464
blynk.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
blynk.menu.eesz.4M2M.build.spiffs_start=0x200000
blynk.menu.eesz.4M2M.build.spiffs_end=0x3FA000
blynk.menu.eesz.4M2M.build.spiffs_blocksize=8192
blynk.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
blynk.menu.eesz.4M3M.build.flash_size=4M
blynk.menu.eesz.4M3M.build.flash_size_bytes=0x400000
blynk.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
blynk.menu.eesz.4M3M.build.spiffs_pagesize=256
blynk.menu.eesz.4M3M.upload.maximum_size=1044464
blynk.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
blynk.menu.eesz.4M3M.build.spiffs_start=0x100000
blynk.menu.eesz.4M3M.build.spiffs_end=0x3FA000
blynk.menu.eesz.4M3M.build.spiffs_blocksize=8192
blynk.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
blynk.menu.eesz.4M1M.build.flash_size=4M
blynk.menu.eesz.4M1M.build.flash_size_bytes=0x400000
blynk.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
blynk.menu.eesz.4M1M.build.spiffs_pagesize=256
blynk.menu.eesz.4M1M.upload.maximum_size=1044464
blynk.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
blynk.menu.eesz.4M1M.build.spiffs_start=0x300000
blynk.menu.eesz.4M1M.build.spiffs_end=0x3FA000
blynk.menu.eesz.4M1M.build.spiffs_blocksize=8192
blynk.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
blynk.menu.eesz.4M.build.flash_size=4M
blynk.menu.eesz.4M.build.flash_size_bytes=0x400000
blynk.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
blynk.menu.eesz.4M.build.spiffs_pagesize=256
blynk.menu.eesz.4M.upload.maximum_size=1044464
blynk.menu.eesz.4M.build.rfcal_addr=0x3FC000
blynk.menu.ip.lm2f=v2 Lower Memory
blynk.menu.ip.lm2f.build.lwip_include=lwip2/include
blynk.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
blynk.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
blynk.menu.ip.hb2f=v2 Higher Bandwidth
blynk.menu.ip.hb2f.build.lwip_include=lwip2/include
blynk.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
blynk.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
blynk.menu.ip.lm2n=v2 Lower Memory (no features)
blynk.menu.ip.lm2n.build.lwip_include=lwip2/include
blynk.menu.ip.lm2n.build.lwip_lib=-llwip2-536
blynk.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
blynk.menu.ip.hb2n=v2 Higher Bandwidth (no features)
blynk.menu.ip.hb2n.build.lwip_include=lwip2/include
blynk.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
blynk.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
blynk.menu.ip.lm6f=v2 IPv6 Lower Memory
blynk.menu.ip.lm6f.build.lwip_include=lwip2/include
blynk.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
blynk.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
blynk.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
blynk.menu.ip.hb6f.build.lwip_include=lwip2/include
blynk.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
blynk.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
blynk.menu.dbg.Disabled=Disabled
blynk.menu.dbg.Disabled.build.debug_port=
blynk.menu.dbg.Serial=Serial
blynk.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
blynk.menu.dbg.Serial1=Serial1
blynk.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
blynk.menu.lvl.None____=None
blynk.menu.lvl.None____.build.debug_level=
blynk.menu.lvl.SSL=SSL
blynk.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
blynk.menu.lvl.TLS_MEM=TLS_MEM
blynk.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
blynk.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
blynk.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
blynk.menu.lvl.HTTP_SERVER=HTTP_SERVER
blynk.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
blynk.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
blynk.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
blynk.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
blynk.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
blynk.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
blynk.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
blynk.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
blynk.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
blynk.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
blynk.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
blynk.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
blynk.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
blynk.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
blynk.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
blynk.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
blynk.menu.lvl.CORE=CORE
blynk.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
blynk.menu.lvl.WIFI=WIFI
blynk.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
blynk.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
blynk.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
blynk.menu.lvl.UPDATER=UPDATER
blynk.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
blynk.menu.lvl.OTA=OTA
blynk.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
blynk.menu.lvl.OOM=OOM
blynk.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
blynk.menu.lvl.MDNS=MDNS
blynk.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
blynk.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
blynk.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
blynk.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
blynk.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
blynk.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
blynk.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
blynk.menu.wipe.none=Only Sketch
blynk.menu.wipe.none.upload.erase_cmd=
blynk.menu.wipe.sdk=Sketch + WiFi Settings
blynk.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
blynk.menu.wipe.all=All Flash Contents
blynk.menu.wipe.all.upload.erase_cmd=erase_flash
blynk.menu.baud.115200=115200
blynk.menu.baud.115200.upload.speed=115200
blynk.menu.baud.57600=57600
blynk.menu.baud.57600.upload.speed=57600
blynk.menu.baud.230400.linux=230400
blynk.menu.baud.230400.macosx=230400
blynk.menu.baud.230400.upload.speed=230400
blynk.menu.baud.256000.windows=256000
blynk.menu.baud.256000.upload.speed=256000
blynk.menu.baud.460800.linux=460800
blynk.menu.baud.460800.macosx=460800
blynk.menu.baud.460800.upload.speed=460800
blynk.menu.baud.512000.windows=512000
blynk.menu.baud.512000.upload.speed=512000
blynk.menu.baud.921600=921600
blynk.menu.baud.921600.upload.speed=921600
blynk.menu.baud.3000000=3000000
blynk.menu.baud.3000000.upload.speed=3000000

