esp8266/Arduino/boards.txt
##############################################################
wifinfo.name=WifInfo
wifinfo.build.board=WIFINFO
wifinfo.build.variant=wifinfo
wifinfo.menu.ESPModule.ESP07192=ESP07 (1M/192K FS)
wifinfo.menu.ESPModule.ESP07192.build.board=ESP8266_ESP07
wifinfo.menu.ESPModule.ESP07192.build.flash_ld=eagle.flash.1m192.ld
wifinfo.menu.ESPModule.ESP07192.build.flash_size=1M
wifinfo.menu.ESPModule.ESP07192.build.spiffs_blocksize=4096
wifinfo.menu.ESPModule.ESP07192.build.spiffs_end=0xFB000
wifinfo.menu.ESPModule.ESP07192.build.spiffs_start=0xCB000
wifinfo.menu.ESPModule.ESP07192.upload.maximum_size=827376
wifinfo.menu.ESPModule.ESP12=ESP12 (4M/1M FS)
wifinfo.menu.ESPModule.ESP12.build.board=ESP8266_ESP12
wifinfo.menu.ESPModule.ESP12.build.flash_ld=eagle.flash.4m1m.ld
wifinfo.menu.ESPModule.ESP12.build.flash_size=4M
wifinfo.menu.ESPModule.ESP12.build.spiffs_blocksize=8192
wifinfo.menu.ESPModule.ESP12.build.spiffs_end=0x3FB000
wifinfo.menu.ESPModule.ESP12.build.spiffs_pagesize=256
wifinfo.menu.ESPModule.ESP12.build.spiffs_start=0x300000
wifinfo.menu.ESPModule.ESP12.upload.maximum_size=1044464
wifinfo.upload.tool=esptool
wifinfo.upload.maximum_data_size=81920
wifinfo.upload.wait_for_upload_port=true
wifinfo.upload.erase_cmd=
wifinfo.serial.disableDTR=true
wifinfo.serial.disableRTS=true
wifinfo.build.mcu=esp8266
wifinfo.build.core=esp8266
wifinfo.build.spiffs_pagesize=256
wifinfo.build.debug_port=
wifinfo.build.debug_level=
wifinfo.menu.xtal.80=80 MHz
wifinfo.menu.xtal.80.build.f_cpu=80000000L
wifinfo.menu.xtal.160=160 MHz
wifinfo.menu.xtal.160.build.f_cpu=160000000L
wifinfo.menu.vt.flash=Flash
wifinfo.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
wifinfo.menu.vt.heap=Heap
wifinfo.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
wifinfo.menu.vt.iram=IRAM
wifinfo.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
wifinfo.menu.exception.disabled=Disabled (new aborts on oom)
wifinfo.menu.exception.disabled.build.exception_flags=-fno-exceptions
wifinfo.menu.exception.disabled.build.stdcpp_lib=-lstdc++
wifinfo.menu.exception.enabled=Enabled
wifinfo.menu.exception.enabled.build.exception_flags=-fexceptions
wifinfo.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
wifinfo.menu.stacksmash.disabled=Disabled
wifinfo.menu.stacksmash.disabled.build.stacksmash_flags=
wifinfo.menu.stacksmash.enabled=Enabled
wifinfo.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
wifinfo.menu.ssl.all=All SSL ciphers (most compatible)
wifinfo.menu.ssl.all.build.sslflags=
wifinfo.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
wifinfo.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
wifinfo.menu.waveform.pwm=Locked PWM
wifinfo.menu.waveform.pwm.build.waveform=
wifinfo.menu.waveform.phase=Locked Phase
wifinfo.menu.waveform.phase.build.waveform=-DWAVEFORM_LOCKED_PHASE
wifinfo.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
wifinfo.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
wifinfo.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
wifinfo.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
wifinfo.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
wifinfo.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
wifinfo.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
wifinfo.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
wifinfo.menu.mmu.ext128k=128K External 23LC1024
wifinfo.menu.mmu.ext128k.build.mmuflags=-DUMM_HEAP_EXTERNAL=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
wifinfo.menu.mmu.ext1024k=1M External 64 MBit PSRAM
wifinfo.menu.mmu.ext1024k.build.mmuflags=-DUMM_HEAP_EXTERNAL=1024 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
wifinfo.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
wifinfo.menu.non32xfer.fast.build.non32xferflags=
wifinfo.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
wifinfo.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
wifinfo.upload.resetmethod=--before default_reset --after hard_reset
wifinfo.build.flash_mode=qio
wifinfo.build.flash_flags=-DFLASHMODE_QIO
wifinfo.menu.FlashFreq.40=40MHz
wifinfo.menu.FlashFreq.40.build.flash_freq=40
wifinfo.menu.FlashFreq.80=80MHz
wifinfo.menu.FlashFreq.80.build.flash_freq=80
wifinfo.menu.FlashFreq.20=20MHz
wifinfo.menu.FlashFreq.20.build.flash_freq=20
wifinfo.menu.FlashFreq.26=26MHz
wifinfo.menu.FlashFreq.26.build.flash_freq=26
wifinfo.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
wifinfo.menu.eesz.1M64.build.flash_size=1M
wifinfo.menu.eesz.1M64.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
wifinfo.menu.eesz.1M64.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M64.upload.maximum_size=958448
wifinfo.menu.eesz.1M64.build.rfcal_addr=0xFC000
wifinfo.menu.eesz.1M64.build.spiffs_start=0xEB000
wifinfo.menu.eesz.1M64.build.spiffs_end=0xFB000
wifinfo.menu.eesz.1M64.build.spiffs_blocksize=4096
wifinfo.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
wifinfo.menu.eesz.1M128.build.flash_size=1M
wifinfo.menu.eesz.1M128.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
wifinfo.menu.eesz.1M128.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M128.upload.maximum_size=892912
wifinfo.menu.eesz.1M128.build.rfcal_addr=0xFC000
wifinfo.menu.eesz.1M128.build.spiffs_start=0xDB000
wifinfo.menu.eesz.1M128.build.spiffs_end=0xFB000
wifinfo.menu.eesz.1M128.build.spiffs_blocksize=4096
wifinfo.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
wifinfo.menu.eesz.1M144.build.flash_size=1M
wifinfo.menu.eesz.1M144.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
wifinfo.menu.eesz.1M144.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M144.upload.maximum_size=876528
wifinfo.menu.eesz.1M144.build.rfcal_addr=0xFC000
wifinfo.menu.eesz.1M144.build.spiffs_start=0xD7000
wifinfo.menu.eesz.1M144.build.spiffs_end=0xFB000
wifinfo.menu.eesz.1M144.build.spiffs_blocksize=4096
wifinfo.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
wifinfo.menu.eesz.1M160.build.flash_size=1M
wifinfo.menu.eesz.1M160.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
wifinfo.menu.eesz.1M160.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M160.upload.maximum_size=860144
wifinfo.menu.eesz.1M160.build.rfcal_addr=0xFC000
wifinfo.menu.eesz.1M160.build.spiffs_start=0xD3000
wifinfo.menu.eesz.1M160.build.spiffs_end=0xFB000
wifinfo.menu.eesz.1M160.build.spiffs_blocksize=4096
wifinfo.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
wifinfo.menu.eesz.1M192.build.flash_size=1M
wifinfo.menu.eesz.1M192.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
wifinfo.menu.eesz.1M192.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M192.upload.maximum_size=827376
wifinfo.menu.eesz.1M192.build.rfcal_addr=0xFC000
wifinfo.menu.eesz.1M192.build.spiffs_start=0xCB000
wifinfo.menu.eesz.1M192.build.spiffs_end=0xFB000
wifinfo.menu.eesz.1M192.build.spiffs_blocksize=4096
wifinfo.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
wifinfo.menu.eesz.1M256.build.flash_size=1M
wifinfo.menu.eesz.1M256.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
wifinfo.menu.eesz.1M256.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M256.upload.maximum_size=761840
wifinfo.menu.eesz.1M256.build.rfcal_addr=0xFC000
wifinfo.menu.eesz.1M256.build.spiffs_start=0xBB000
wifinfo.menu.eesz.1M256.build.spiffs_end=0xFB000
wifinfo.menu.eesz.1M256.build.spiffs_blocksize=4096
wifinfo.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
wifinfo.menu.eesz.1M512.build.flash_size=1M
wifinfo.menu.eesz.1M512.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
wifinfo.menu.eesz.1M512.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M512.upload.maximum_size=499696
wifinfo.menu.eesz.1M512.build.rfcal_addr=0xFC000
wifinfo.menu.eesz.1M512.build.spiffs_start=0x7B000
wifinfo.menu.eesz.1M512.build.spiffs_end=0xFB000
wifinfo.menu.eesz.1M512.build.spiffs_blocksize=8192
wifinfo.menu.eesz.1M=1MB (FS:none OTA:~502KB)
wifinfo.menu.eesz.1M.build.flash_size=1M
wifinfo.menu.eesz.1M.build.flash_size_bytes=0x100000
wifinfo.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
wifinfo.menu.eesz.1M.build.spiffs_pagesize=256
wifinfo.menu.eesz.1M.upload.maximum_size=1023984
wifinfo.menu.eesz.1M.build.rfcal_addr=0xFC000
wifinfo.menu.ip.lm2f=v2 Lower Memory
wifinfo.menu.ip.lm2f.build.lwip_include=lwip2/include
wifinfo.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
wifinfo.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wifinfo.menu.ip.hb2f=v2 Higher Bandwidth
wifinfo.menu.ip.hb2f.build.lwip_include=lwip2/include
wifinfo.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
wifinfo.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wifinfo.menu.ip.lm2n=v2 Lower Memory (no features)
wifinfo.menu.ip.lm2n.build.lwip_include=lwip2/include
wifinfo.menu.ip.lm2n.build.lwip_lib=-llwip2-536
wifinfo.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wifinfo.menu.ip.hb2n=v2 Higher Bandwidth (no features)
wifinfo.menu.ip.hb2n.build.lwip_include=lwip2/include
wifinfo.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
wifinfo.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wifinfo.menu.ip.lm6f=v2 IPv6 Lower Memory
wifinfo.menu.ip.lm6f.build.lwip_include=lwip2/include
wifinfo.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
wifinfo.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wifinfo.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
wifinfo.menu.ip.hb6f.build.lwip_include=lwip2/include
wifinfo.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
wifinfo.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wifinfo.menu.dbg.Disabled=Disabled
wifinfo.menu.dbg.Disabled.build.debug_port=
wifinfo.menu.dbg.Serial=Serial
wifinfo.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wifinfo.menu.dbg.Serial1=Serial1
wifinfo.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
wifinfo.menu.lvl.None____=None
wifinfo.menu.lvl.None____.build.debug_level=
wifinfo.menu.lvl.SSL=SSL
wifinfo.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
wifinfo.menu.lvl.TLS_MEM=TLS_MEM
wifinfo.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
wifinfo.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
wifinfo.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.lvl.HTTP_SERVER=HTTP_SERVER
wifinfo.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
wifinfo.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
wifinfo.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
wifinfo.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
wifinfo.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
wifinfo.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
wifinfo.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
wifinfo.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifinfo.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
wifinfo.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifinfo.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifinfo.menu.lvl.CORE=CORE
wifinfo.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
wifinfo.menu.lvl.WIFI=WIFI
wifinfo.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
wifinfo.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
wifinfo.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
wifinfo.menu.lvl.UPDATER=UPDATER
wifinfo.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
wifinfo.menu.lvl.OTA=OTA
wifinfo.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
wifinfo.menu.lvl.OOM=OOM
wifinfo.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
wifinfo.menu.lvl.MDNS=MDNS
wifinfo.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
wifinfo.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
wifinfo.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
wifinfo.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
wifinfo.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
wifinfo.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
wifinfo.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
wifinfo.menu.wipe.none=Only Sketch
wifinfo.menu.wipe.none.upload.erase_cmd=
wifinfo.menu.wipe.sdk=Sketch + WiFi Settings
wifinfo.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
wifinfo.menu.wipe.all=All Flash Contents
wifinfo.menu.wipe.all.upload.erase_cmd=erase_flash
wifinfo.menu.baud.115200=115200
wifinfo.menu.baud.115200.upload.speed=115200
wifinfo.menu.baud.57600=57600
wifinfo.menu.baud.57600.upload.speed=57600
wifinfo.menu.baud.230400.linux=230400
wifinfo.menu.baud.230400.macosx=230400
wifinfo.menu.baud.230400.upload.speed=230400
wifinfo.menu.baud.256000.windows=256000
wifinfo.menu.baud.256000.upload.speed=256000
wifinfo.menu.baud.460800.linux=460800
wifinfo.menu.baud.460800.macosx=460800
wifinfo.menu.baud.460800.upload.speed=460800
wifinfo.menu.baud.512000.windows=512000
wifinfo.menu.baud.512000.upload.speed=512000
wifinfo.menu.baud.921600=921600
wifinfo.menu.baud.921600.upload.speed=921600
wifinfo.menu.baud.3000000=3000000
wifinfo.menu.baud.3000000.upload.speed=3000000

